This document is a long(er) and sometimes unclear description of using Dart as one of the languages in Emacs org-mode Babel.

You probably want to read file:./../README.org instead.

*** Value (by default) formats results into table. This is somewhat logical, "value" is intended as "functional" mode, to take last statement as a result; and by default , it attempts to format as table


 #+BEGIN_SRC bash :results value
 echo a, b, c
 echo last, statement
 #+END_SRC

 #+RESULTS:
 | a    | b         | c |
 | last | statement |   |


*** Output never(?) formats results into table, but, adds column (:) before results 

 #+BEGIN_SRC bash :results output
 echo a, b, c
 echo last, statement
 #+END_SRC

 #+RESULTS:
 : a, b, c
 : last, statement


*** *Raw always wins - no table formatting, just a raw outpur/result to String Value+raw or Output+raw does not touch result in any way

 #+BEGIN_SRC bash :results output raw
 echo a, b, c
 echo last, statement
 #+END_SRC

 #+RESULTS:
 a, b, c
 last, statement


 #+BEGIN_SRC bash :results value raw
 echo a, b, c
 echo last, statement
 #+END_SRC

 #+RESULTS:
 a, b, c
 last, statement


*** Value (by default) formats results into table. This is somewhat logical, "value" is intended as "functional" mode, to take last statement as a result; and by default , it attempts to format as table

 Value returns result of last statement and formats it as table
 #+BEGIN_SRC python :results value table 
 print ("a", "b", "c")
 print ("d")
 return ("last", "statement", "confusion, here? No!")
 #+END_SRC

 #+RESULTS:
 | last | statement | confusion, here? No! |


*** Output never formats results into table, but, adds column (:) before results 

 #+BEGIN_SRC python :results output table
 print ("a", "b", "c")
 print ("d")
 print "1. 2, 3"
 # return ("last", "statement")  # return not actually allowed if output is used.
 #+END_SRC

 #+RESULTS:
 : ('a', 'b', 'c')
 : d
 : 1. 2, 3



*** Raw always wins - no table formatting, just a raw output/result to String Value+raw or Output+raw does not touch result in any way

 #+BEGIN_SRC python :results output raw
 print ("a", "b", "c")
 print ("d")
 # return ("last", "statement")  # return not actually allowed if output is used.
 #+END_SRC

 #+RESULTS:
 ('a', 'b', 'c')
 d

 #+BEGIN_SRC python :results value raw
 print ("a", "b", "c")
 print ("d")
 return ("last", "statement")  # return not actually allowed if output is used.
 #+END_SRC

 #+RESULTS:
 ('last', 'statement')
 


** Comparing Dart with: Python with classes 

Python can use classes in the snippet, see code below

#+BEGIN_SRC python :results output 
  # from http://www.tutorialspoint.com/python/python_classes_objects.htm
  class Employee:
    empCount = 0
  
    def __init__(self, name, salary):
      self.name = name
      self.salary = salary
      Employee.empCount += 1
  
    def displayCount(self):
      print "Total Employee %d" % Employee.empCount
    
    def displayEmployee(self):
      print "Name : ", self.name,  ", Salary: ", self.salary

  "This would create first object of Employee class"
  emp1 = Employee("Zara", 2000)
  "This would create second object of Employee class"
  emp2 = Employee("Manni", 5000)
  emp1.displayEmployee()
  emp2.displayEmployee()
  msg =  "Total Employee %d" % Employee.empCount

  print msg
  # only for value: return msg
 
#+END_SRC

#+RESULTS:
: Name :  Zara , Salary:  2000
: Name :  Manni , Salary:  5000
: Total Employee 2


** TODO Process data from :var, scalar or table. 

Let us say we want to find five largest files in the tmp directory and calculate their average size. In org mode, we can select the best tool for each task. We can get the file list into a table using a shell command. As we want to address the result table, we specify the output table name as tblname

#+NAME: large_files
#+BEGIN_SRC shell
ls -lS /tmp | grep -v "total " | head -5 | sed 's/\s\+/ /g' | cut -d' ' -f5,9
#+END_SRC

#+RESULTS: large_files
|                                             2147484504 | konsole-hp1876.history                                 |
|                                             1474635432 | konsole-Yh1876.history                                 |
|                                               29111236 | konsole-tF1876.history                                 |
|                                               27673128 | konsole-zT1876.history                                 |
|                                               26149752 | konsole-rF1898.history                                 |
| [2147484504, 1474635432, 29111236, 27673128, 26149752] | [2147484504, 1474635432, 29111236, 27673128, 26149752] |
#+TBLFM: @6$2=@1$1..@5$1

#+BEGIN_SRC sh :var files=large_files[0:4,1:1] :results output
echo $files 
for file in $files; do
  echo File=$file
done
#+END_SRC

#+RESULTS:
: konsole-hp1876.history konsole-Yh1876.history konsole-tF1876.history konsole-zT1876.history konsole-rF1898.history
: File=konsole-hp1876.history
: File=konsole-Yh1876.history
: File=konsole-tF1876.history
: File=konsole-zT1876.history
: File=konsole-rF1898.history

todo: similar example for Dart. 



